{
  "backend/main.mo": "Main ICP actor implementing the Poop Tracker backend with user registration, profile management, poop entry logging, and leaderboard stats, protected by role-based access control.",
  "backend/migration.mo": "Migration module that converts old actor state (users map with array-based entries) to new actor state (state map with List-based entries) for schema upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their associated files, components, test IDs, and confidence levels for build verification.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a quick reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI element tokens.",
  "frontend/index.html": "Minimal HTML shell for the Poop Tracker SPA, mounting the React app at the root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root app component implementing two-phase routing: shows a loading spinner while identity/actor/profile resolve, then routes to LoginPage, ProfileSetup, or Dashboard based on auth and profile state.",
  "frontend/src/components/AllTimeStandings.tsx": "Empty file — the AllTimeStandings component has been removed or not yet implemented.",
  "frontend/src/components/Layout.tsx": "App shell layout with a sticky header (logo, home navigation, logout button), main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/Leaderboard.tsx": "Empty file — the Leaderboard component has been removed or not yet implemented.",
  "frontend/src/components/LeaderboardToggle.tsx": "Empty file — the LeaderboardToggle component has been removed or not yet implemented.",
  "frontend/src/components/ProfilePreview.tsx": "Reusable profile avatar component rendering a user's emoji inside a gradient-background circle with a colored border, supporting sm/md/lg sizes and an optional display name.",
  "frontend/src/constants/profileOptions.ts": "Exports preset arrays of 40 emoji options, 20 hex color options, and 12 gradient background strings used for profile customization.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profile, poop entry creation, and ranked user stats.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the app's design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying the user's personal poop/wipe stats, a leaderboard with lifetime and daily view modes, and leader badges for top users.",
  "frontend/src/pages/LoginPage.tsx": "Login page that presents a branded card with an Internet Identity login button for unauthenticated users.",
  "frontend/src/pages/LogPoop.tsx": "Multi-step form page for logging a poop entry, prompting the user to confirm, enter wipe count, and showing a success state after submission.",
  "frontend/src/pages/ProfileSetup.tsx": "A profile creation page where users enter a display name and select an emoji, color, and background, then submit to register via the actor mutation with a live preview component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, typography/container/animate plugins, and accordion keyframe animations.",
  "project_state.json": "Project state metadata describing the poop tracker app's architecture, existing features, known issues, and rebuild goals including Internet Identity auth, user profiles, and a unified dashboard."
}