{
  "backend/main.mo": "Motoko actor implementing the Poop Tracker backend with user registration, poop entry logging, profile retrieval, ranked user stats, and daily statistics calculations stored in a principal-keyed map.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a tri-state profile detection rewrite in App.tsx and a guarded useProfile hook rewrite in useQueries.ts, both preventing premature 'no profile' routing during actor initialization.",
  "frontend-file-summaries.txt": "A JSON map of frontend source file paths to short human-readable summaries describing each file's role and notable implementation details in the Poop Tracker app.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for the app's light and dark color themes including sidebar, chart, and semantic UI tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Poop Tracker Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root app component implementing tri-state profile detection ('loading'/'has-profile'/'no-profile') using TanStack Router and React Query, deferring all routing until identity, actor, and profile query are fully resolved.",
  "frontend/src/components/AllTimeStandings.tsx": "Displays a sortable all-time leaderboard table with per-user stats (poops, wipes, TP rolls, avg wipes) and badges for King Pooper, King Wiper, and The Efficient Wiper roles.",
  "frontend/src/components/Layout.tsx": "App shell layout component providing a sticky header with navigation and logout button, a main content area, and a footer with caffeine.ai attribution.",
  "frontend/src/components/Leaderboard.tsx": "Displays a lifetime leaderboard card with three award categories (King Pooper, King Wiper, Efficient Wiper) derived from ranked user stats, including an MVP badge when one user holds both top titles.",
  "frontend/src/components/LeaderboardToggle.tsx": "Empty file with no content or exports.",
  "frontend/src/components/ProfilePreview.tsx": "Renders a user profile avatar (emoji on a colored/gradient background) with an optional display name, supporting three size variants.",
  "frontend/src/constants/profileOptions.ts": "Exports three constant arrays of selectable profile customization options: emojis, hex color values, and CSS gradient background strings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data: user profile, profile registration, poop entry creation, and ranked user stats.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the app's design token system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing a welcome card with the user's profile, a quick poop-log button, the Leaderboard component, AllTimeStandings, and an informational about card.",
  "frontend/src/pages/LoginPage.tsx": "Login page that displays a branded card with an Internet Identity login button, using the useInternetIdentity hook to handle authentication.",
  "frontend/src/pages/LogPoop.tsx": "Multi-step page component for logging a poop entry, guiding the user through confirmation, wipe count input, and a success screen, then submitting via a mutation to the backend actor.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation page allowing users to set a display name and choose an emoji, color, and background, with a live preview and a mutation to register the profile via the backend actor.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via oklch variables, fonts, border radii, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking the current version, feature list, architectural notes, and known issues for the poop tracker app."
}