{
  "backend/main.mo": "Motoko actor implementing the Poop Tracker backend with user registration, poop entry logging, profile retrieval, ranked user stats, and daily stats calculations stored in a principal-keyed map.",
  "feature_evidence.json": "Feature evidence report listing confirmed implementation features for reverting App.tsx, useQueries.ts, Leaderboard.tsx, and AllTimeStandings.tsx to pre-Efficient-Wiper-badge working versions, with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short human-readable summaries describing each file's role and key implementation details in the Poop Tracker app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the design system's color palette in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Poop Tracker SPA, mounting the React app at the #root div and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root TanStack Router setup with a RootComponent that handles auth/profile loading states and conditionally renders LoginPage, ProfileSetup, or the main Layout with Dashboard and LogPoop routes.",
  "frontend/src/components/AllTimeStandings.tsx": "Displays a sortable all-time rankings table with columns for rank, user profile, total poops, wipes, TP rolls, and average wipes per poop, highlighting King Pooper and King Wiper without any Efficient Wiper logic.",
  "frontend/src/components/Layout.tsx": "App shell component providing a sticky header with logo, home/logout navigation, a main content area, and a footer with caffeine.ai attribution.",
  "frontend/src/components/Leaderboard.tsx": "Displays a lifetime leaderboard card showing 'King Pooper' and 'King Wiper' titles based on ranked user stats, with an MVP badge if one user holds both titles. Handles loading and empty states with skeletons and placeholder text.",
  "frontend/src/components/LeaderboardToggle.tsx": "Empty file with no content.",
  "frontend/src/components/ProfilePreview.tsx": "Renders a user profile avatar as a styled circle with emoji, background gradient, and border color, optionally displaying the user's display name below it in configurable sizes.",
  "frontend/src/constants/profileOptions.ts": "Exports three arrays of preset options for profile customization: emoji choices, hex color values, and CSS gradient background strings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking across the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data: user profile retrieval, profile registration, poop entry creation, and ranked user stats.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light and dark mode CSS custom properties for the app's design token system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing a welcome card with the user's profile, a quick poop-logging button, the Leaderboard, AllTimeStandings, and an informational card about the app.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page with an Internet Identity login button, using a playful poop-themed card layout and gradient background.",
  "frontend/src/pages/LogPoop.tsx": "Multi-step page for logging a poop event: first confirms the action, then collects the number of wipes via a form, and finally shows a success state after submitting to the backend.",
  "frontend/src/pages/ProfileSetup.tsx": "Provides a profile creation form where users pick a display name, emoji, color, and background, then registers the profile via the actor mutation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors using oklch variables, typography, border radius, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state including version, feature list, architectural notes, and known issues for the poop tracker app."
}