{
  "kind": "build_request",
  "title": "Fix profile detection so existing users skip profile creation on startup",
  "projectName": "Poop Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Rewrite the useProfile hook in useQueries.ts using a manual async approach: use a plain React useState + useEffect (or useQuery with enabled guard) so the backend getProfile call is only fired after the actor is confirmed non-null. The hook must remain in a 'loading' state (isLoading: true, data: undefined) while the actor is undefined or null, and only transition to a settled state (isLoading: false) after the async call has fully resolved. It must never return a null/empty profile result before the backend call has actually completed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "it keeps redirecting to profile creation screen when it starts. and its stuck there. I already have a profile so I want it to recognize that"
        ]
      },
      "acceptanceCriteria": [
        "The useProfile hook does not fire any backend call when the actor is undefined or null",
        "The hook stays in isLoading=true state until the actor is ready AND the backend call has resolved",
        "The hook only returns a 'no profile' result (null/empty data, isLoading=false) after the backend explicitly responds with no profile",
        "The hook returns the profile data correctly when the backend responds with an existing profile"
      ]
    },
    {
      "id": "REQ-33",
      "text": "Rewrite the routing/profile-detection logic in App.tsx using a simple two-phase approach: Phase 1 — show a full-screen loading spinner while the actor is not yet initialized OR while the profile query has not yet settled (isLoading is true). Phase 2 — once the query has settled, if a profile exists navigate to the Dashboard; if no profile exists navigate to ProfileSetup. Do NOT use a tri-state enum pattern. Do NOT make any routing decision (render ProfileSetup or Dashboard) until both conditions are true: actor is non-null AND isLoading is false.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "it keeps redirecting to profile creation screen when it starts. and its stuck there. I already have a profile so I want it to recognize that"
        ]
      },
      "acceptanceCriteria": [
        "App shows a loading spinner on startup until the actor is ready and the profile query resolves",
        "If the user already has a profile, the app navigates directly to the Dashboard without ever rendering ProfileSetup",
        "If the user genuinely has no profile, the app navigates to ProfileSetup after the query confirms no profile exists",
        "App never routes to ProfileSetup prematurely (i.e., before the backend call completes)",
        "The app does not get stuck on a loading screen indefinitely — once the actor is ready and the query resolves, it always transitions to one of the two states"
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a safety timeout to the profile loading sequence in App.tsx: if after 10 seconds the actor is still not initialized or the profile query has not resolved, treat the state as 'no profile' and allow the user to proceed to ProfileSetup rather than staying stuck indefinitely. Display a user-friendly message in the loading state such as 'Loading your profile…'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "its stuck there"
        ]
      },
      "acceptanceCriteria": [
        "App never stays stuck on the loading screen indefinitely",
        "After 10 seconds without resolution, app falls through to ProfileSetup",
        "Loading screen shows a readable message like 'Loading your profile…'"
      ]
    }
  ],
  "constraints": [
    "Do not change any backend Motoko code",
    "Do not modify files under frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, or frontend/src/main.tsx",
    "Do not introduce a tri-state enum pattern ('loading'/'has-profile'/'no-profile') that previously caused the app to get stuck indefinitely",
    "Do not break the existing Leaderboard, AllTimeStandings, or other components — only change App.tsx and useQueries.ts"
  ],
  "nonGoals": [
    "Adding new features or pages",
    "Changing the profile creation form or its fields",
    "Modifying the leaderboard or standings components",
    "Changing authentication flow or Internet Identity integration",
    "Any backend schema changes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}