{
  "kind": "build_request",
  "title": "Rebuild app from scratch — core features only: login, profiles, unified dashboard with Lifetime/Daily toggle",
  "projectName": "Poop Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Rewrite the Motoko backend (backend/main.mo) from scratch with a clean, minimal implementation supporting: (1) user profile registration and retrieval keyed by principal (displayName, emoji, color, background), (2) logging a poop entry with wipe count and auto-timestamp, (3) retrieving all entries for the authenticated principal, (4) retrieving ranked stats for all users (total poops, total wipes) for both lifetime and daily (today) scopes. Remove any dead or unused functions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "simply the entire code in this app to bring it back to the features that we first started",
          "keep the login and user profiles and yes one dashboard with the toggle feature"
        ]
      },
      "acceptanceCriteria": [
        "registerProfile stores and retrieves a profile by caller principal",
        "getProfile returns the caller's profile or null if none exists",
        "logPoop records a poop entry with wipe count and a nanosecond timestamp",
        "getRankedStats returns total poops and total wipes per user for all-time",
        "getDailyStats returns today's poops and total wipes per user filtered to the current UTC day",
        "Backend compiles and deploys without errors"
      ]
    },
    {
      "id": "REQ-36",
      "text": "Rewrite App.tsx from scratch with simple, reliable two-phase routing: (1) while the actor is null OR the profile query is still loading, show a full-screen centered loading spinner with the text 'Loading your profile…'; (2) once both the actor is initialized AND the profile query has settled, route to LoginPage if not authenticated, ProfileSetup if authenticated but no profile exists, or Dashboard if authenticated and a profile exists. Do not use tri-state enums. Do not render ProfileSetup or Dashboard until the profile query has fully resolved.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "simply the entire code",
          "keep the login and user profiles"
        ]
      },
      "acceptanceCriteria": [
        "A loading spinner is shown while identity or profile data is resolving",
        "Unauthenticated users see LoginPage",
        "Authenticated users with an existing profile go directly to Dashboard without hitting ProfileSetup",
        "Authenticated users with no profile are routed to ProfileSetup",
        "No routing decision is made until both actor is non-null and isLoading is false"
      ]
    },
    {
      "id": "REQ-37",
      "text": "Rewrite the useProfile hook in useQueries.ts using useQuery with an enabled guard: the backend getProfile call must only fire when the actor is confirmed non-null. The hook must return isLoading: true while the actor is undefined/null or while the query is in flight, and only return a settled result (profile or null) after the async call has fully completed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "simply the entire code"
        ]
      },
      "acceptanceCriteria": [
        "useProfile does not fire the backend call when actor is undefined or null",
        "isLoading remains true until the backend call has fully resolved",
        "A null/empty result is only returned after a confirmed backend response, not prematurely",
        "Hook works correctly on first login and on page refresh for existing users"
      ]
    },
    {
      "id": "REQ-38",
      "text": "Rewrite the Dashboard page (frontend/src/pages/Dashboard.tsx) as a single unified page with: (1) a Lifetime/Daily toggle at the top, (2) a personal stats card showing the logged-in user's total poops and total wipes (lifetime or today depending on toggle), (3) a 'Log a Poop' button that navigates to the log flow, (4) a leaderboard/standings section showing all users ranked by total poops with columns for display name/emoji, total poops, total wipes — filtered by the selected toggle mode. Remove all Efficient Wiper references. Remove separate Leaderboard and AllTimeStandings components if they cause complexity; inline the logic cleanly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "one dashboard with the toggle feature",
          "log poops and wipes and a simple dashboard for lifetime and daily trackin"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard has a clearly visible Lifetime/Daily toggle",
        "Personal stats card updates when toggle is switched",
        "Leaderboard/standings table updates when toggle is switched",
        "King Pooper (most poops) and King Wiper (most wipes) badges are shown, with MVP badge if one user holds both",
        "No Efficient Wiper badge or highlighting anywhere",
        "Log a Poop button is present and functional",
        "Page renders without errors for both authenticated users with and without entries"
      ]
    },
    {
      "id": "REQ-39",
      "text": "Keep the ProfileSetup page (frontend/src/pages/ProfileSetup.tsx) intact and functional: allow users to set a display name, choose from preset emojis, pick a color and background, preview their profile, and submit the profile to the backend. Ensure emojis are properly centered in their selection boxes on mobile.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "keep the login and user profiles"
        ]
      },
      "acceptanceCriteria": [
        "User can enter a display name",
        "User can select an emoji, color, and background from presets",
        "A live preview of the profile avatar is shown",
        "Submitting the form calls registerProfile on the backend",
        "On successful registration, user is routed to Dashboard",
        "Emojis are centered in their selection boxes on mobile screens"
      ]
    },
    {
      "id": "REQ-40",
      "text": "Keep the LogPoop page (frontend/src/pages/LogPoop.tsx) intact: a simple multi-step flow where the user confirms they want to log a poop, enters the number of wipes, and sees a success screen. The entry is submitted to the backend with a timestamp.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "log poops and wipes"
        ]
      },
      "acceptanceCriteria": [
        "User can initiate logging a poop from the Dashboard",
        "User is prompted to enter number of wipes",
        "On submission, logPoop is called on the backend with wipe count",
        "A success confirmation screen is shown after logging",
        "User can navigate back to Dashboard after logging"
      ]
    },
    {
      "id": "REQ-41",
      "text": "Keep the LoginPage (frontend/src/pages/LoginPage.tsx) intact with the Internet Identity login button and playful branding. No functional changes needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "keep the login and user profiles"
        ]
      },
      "acceptanceCriteria": [
        "Login page displays with Internet Identity login button",
        "Clicking login triggers the Internet Identity authentication flow",
        "After successful login, user is routed through the profile detection logic in App.tsx"
      ]
    }
  ],
  "constraints": [
    "Do not add The Efficient Wiper badge or any reference to it anywhere in the codebase",
    "Do not use a tri-state enum pattern in App.tsx — use simple two-phase loading logic only",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All Motoko logic must remain in backend/main.mo as a single actor"
  ],
  "nonGoals": [
    "No separate Leaderboard page — all stats live on one unified Dashboard",
    "No Efficient Wiper badge or standings highlighting",
    "No tri-state profile routing logic",
    "No external databases or third-party services",
    "No real-time updates or WebSockets"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}