{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert to last working version before Efficient Wiper changes",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Revert App.tsx to use simple profile detection and routing without tri-state loading pattern",
      "acceptanceCriteria": [
        "App no longer gets stuck on a loading screen after authenticating with Internet Identity",
        "App.tsx does not contain the tri-state loading/has-profile/no-profile pattern from Version 9",
        "Users can authenticate and reach the dashboard without the app hanging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the tri-state ('loading'/'has-profile'/'no-profile') profile detection system with the original simple, direct profile detection and routing logic that was working before the Efficient Wiper changes. Remove deferred routing and restore immediate route rendering with inline profile checks."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Revert useQueries.ts to original profile-fetching logic without guarded actor-initialization",
      "acceptanceCriteria": [
        "useQueries.ts does not contain the guarded actor-initialization checks added in the broken versions",
        "Profile fetching works correctly and does not cause the app to hang in a loading state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the guarded useProfile hook rewrite and restore the original profile-fetching logic that existed before the Efficient Wiper badge changes. Ensure the useProfile hook uses standard React Query patterns without additional actor-readiness guards."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Remove Efficient Wiper badge from Leaderboard component while preserving lifetime/daily toggle",
      "acceptanceCriteria": [
        "Leaderboard.tsx shows only King Pooper, King Wiper, and MVP badge — no Efficient Wiper badge",
        "Lifetime/daily toggle still functions correctly",
        "No references to Efficient Wiper logic remain in Leaderboard.tsx"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Leaderboard.tsx",
          "operation": "modify",
          "description": "Remove The Efficient Wiper award category and all related logic from the top badges section. Restore the component to display only King Pooper, King Wiper, and MVP badge. Ensure the lifetime/daily toggle remains fully functional."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Remove Efficient Wiper highlighting from AllTimeStandings table while preserving all columns and toggle",
      "acceptanceCriteria": [
        "AllTimeStandings.tsx contains no Efficient Wiper highlight or badge logic",
        "Standings table still displays all required columns (display name/emoji, total poops, total wipes, TP rolls, avg wipes per poop)",
        "Lifetime/daily toggle still works correctly in the standings table"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AllTimeStandings.tsx",
          "operation": "modify",
          "description": "Remove all Efficient Wiper visual highlighting and badge logic from the standings table. Preserve all existing columns (display name/emoji, total poops, total wipes, toilet paper rolls used, average wipes per poop) and ensure the lifetime/daily toggle continues to function correctly."
        }
      ]
    }
  ]
}