{
  "backend/main.mo": "Main Motoko actor implementing user registration, poop entry logging, profile retrieval, and ranked user statistics calculation including total poops, wipes, toilet paper rolls (wipes/10), and average wipes per poop.",
  "backend/migration.mo": "Migration module defining old actor types (OldProfile, OldEntry, OldUserData) with a no-op run function that returns the old actor unchanged.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: lifetime leaderboard with King Pooper/Wiper/MVP badges, toilet paper roll consumption calculation, average wipes per poop metric, and all-time standings table with comprehensive user rankings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 13 frontend files covering routing, authentication, profile setup, dashboard, logging flow, layout, styling, and data fetching hooks.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for a warm amber/orange themed UI.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Poop Tracker app.",
  "frontend/src/App.tsx": "TanStack Router setup with authentication flow that routes users to login, profile setup, or dashboard based on identity and profile state, with routes for dashboard and log poop pages.",
  "frontend/src/components/AllTimeStandings.tsx": "Displays comprehensive rankings table sorted by total poops then wipes, showing ProfilePreview, stats, calculated TP rolls (3 sheets/wipe, 200 sheets/roll), average wipes per poop, and leader badges for King Pooper and King Wiper.",
  "frontend/src/components/Layout.tsx": "App layout wrapper with sticky header (logo, home button, logout), main content area, and footer with caffeine.ai attribution and copyright.",
  "frontend/src/components/Leaderboard.tsx": "Displays a leaderboard card showing the \"King Pooper\" (most total poops) and \"King Wiper\" (most total wipes) with profile previews, stats, and an MVP badge if one user holds both titles.",
  "frontend/src/components/ProfilePreview.tsx": "Renders a user profile avatar with customizable size (sm/md/lg), displaying an emoji on a gradient background with optional display name below.",
  "frontend/src/constants/profileOptions.ts": "Exports arrays of emoji options (40 emojis), color options (20 hex colors), and background gradient options (12 gradients) for user profile customization.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor instance based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching user profiles, registering profiles, creating poop entries, and retrieving ranked user statistics from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using oklch color space for consistent design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying welcome message, quick log button, leaderboard, all-time standings, and app information for authenticated users.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that displays a playful poop tracker branding and a button to authenticate users via Internet Identity.",
  "frontend/src/pages/LogPoop.tsx": "Multi-step form page for logging a poop entry: confirms the action, collects number of wipes, submits to backend, and shows success state with navigation options.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation page where users set their display name and customize their avatar by selecting an emoji, color, and background from predefined options.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH, typography, animations, and design system variables for the app's theme.",
  "project_state.json": "Project metadata tracking implemented features including Internet Identity auth, user profiles, poop/wipe logging, leaderboards, and daily progress views with architectural notes about data storage and calculations."
}